tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "alexstrnik/browserino"
tap "ankitpokhrel/jira-cli"
tap "antoniorodr/memo"
tap "aws/tap"
tap "cargo-lambda/cargo-lambda"
tap "copernicusone/vega"
tap "datawire/blackbird"
tap "gofireflyio/aiac"
tap "googlecontainertools/kpt", "https://github.com/GoogleContainerTools/kpt.git"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "hidetatz/tap"
tap "jesseduffield/lazydocker"
tap "k8sgpt-ai/k8sgpt"
tap "kubecolor/tap"
tap "kubeshop/botkube"
tap "manaflow-ai/cmux"
tap "mhaeuser/mhaeuser"
tap "noovolari/brew"
tap "oven-sh/bun"
tap "sst/tap"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "systemcraftsman/strimzi-kafka-cli"
tap "vectordotdev/brew"
tap "weaveworks/tap"
brew "age"
brew "libtiff"
brew "little-cms2"
brew "asdf"
brew "atuin"
brew "automake"
brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "bat"
brew "bats-core"
brew "glib"
brew "pycparser"
brew "cffi"
brew "chezmoi"
brew "clamav"
brew "clusterawsadm"
brew "clusterctl"
brew "colordiff"
brew "direnv"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "docutils"
brew "duti"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gitleaks"
brew "unbound"
brew "gnutls"
brew "gonzo"
brew "googleworkspace-cli"
brew "harfbuzz"
brew "helm"
brew "htop"
brew "httpie"
brew "httping"
brew "ipcalc"
brew "iproute2mac"
brew "jira-cli"
brew "jiratui"
brew "jq"
brew "jwt-cli"
brew "k2tf"
brew "k8sgpt"
brew "k9s"
brew "librdkafka"
brew "kcat"
brew "kind"
brew "kompose"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubecm"
brew "kubectx"
brew "kustomize"
brew "lazygit"
brew "libgcrypt"
brew "libpq"
brew "libtool"
brew "libzip"
brew "locust"
brew "openjdk"
brew "maven"
brew "minikube"
brew "node"
brew "mongosh"
brew "neovim"
brew "openjdk@21"
brew "operator-sdk"
brew "parallel"
brew "perl"
brew "pg_top"
brew "pipx"
brew "pkgconf"
brew "pre-commit"
brew "protobuf@3"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "qemu"
brew "ripgrep"
brew "rke"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "skaffold"
brew "snyk-cli"
brew "sops"
brew "sox"
brew "sslscan"
brew "starship"
brew "stern"
brew "summarize"
brew "tailscale"
brew "telnet"
brew "terraform-docs"
brew "terraform_landscape"
brew "tfenv"
brew "tflint"
brew "tldr"
brew "tmux"
brew "tree"
brew "uv"
brew "uvicorn"
brew "victorialogs", restart_service: :changed
brew "victoriametrics", restart_service: :changed
brew "virtualenv", link: false
brew "watch"
brew "wget"
brew "yamllint"
brew "yq"
brew "zoxide"
brew "zsh"
brew "antoniorodr/memo/memo"
brew "aws/tap/eks-node-viewer"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
brew "copernicusone/vega/c1-vega-plen"
brew "datawire/blackbird/telepresence-arm64"
brew "gofireflyio/aiac/aiac"
brew "googlecontainertools/kpt/kpt"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform", link: false
brew "hidetatz/tap/kubecolor"
brew "jesseduffield/lazydocker/lazydocker"
brew "kubeshop/botkube/botkube"
brew "noovolari/brew/leapp-cli-darwin-arm64"
brew "oven-sh/bun/bun"
brew "sst/tap/opencode"
brew "steipete/tap/remindctl"
brew "stripe/stripe-cli/stripe"
brew "vectordotdev/brew/vector"
brew "weaveworks/tap/eksctl"
cask "1password-cli"
cask "mhaeuser/mhaeuser/battery-toolkit"
cask "betterdisplay"
cask "alexstrnik/browserino/browserino"
cask "browserosaurus"
cask "calibre"
cask "chatgpt"
cask "cloudflare-warp"
cask "cmux"
cask "codex"
cask "steipete/tap/codexbar"
cask "dbeaver-community"
cask "drawio"
cask "font-meslo-lg-nerd-font"
cask "freelens"
cask "hiddenbar"
cask "hovrly"
cask "iptvnator"
cask "keepassxc"
cask "leapp"
cask "macfuse"
cask "mounty"
cask "stats"
vscode "4ops.terraform"
vscode "alefragnani.rtf"
vscode "anthropic.claude-code"
vscode "balazs4.gitlab-pipeline-monitor"
vscode "ban.spellright"
vscode "barrsan.reui"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "darkriszty.markdown-table-prettify"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dhoeric.ansible-vault"
vscode "dotjoshjohnson.xml"
vscode "dunstontc.vscode-docker-syntax"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fcrespo82.markdown-table-formatter"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "hosho.solidity-debugger"
vscode "huntertran.auto-markdown-toc"
vscode "in4margaret.compareit"
vscode "inercia.vscode-k3d"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "juanblanco.solidity"
vscode "kohkimakimoto.vscode-mac-dictionary"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "p1c2u.docker-compose"
vscode "p1c2u.jenkins"
vscode "phplasma.csv-to-table"
vscode "pkief.material-icon-theme"
vscode "quentingruber.dockerfiletemplate"
vscode "redhat.ansible"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "searking.preview-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-polish"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yzane.markdown-pdf"
vscode "yzhang.dictionary-completion"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
go "golang.org/x/tools/gopls"
go "github.com/VictoriaMetrics-Community/mcp-victoriametrics/cmd/mcp-victoriametrics"
go "honnef.co/go/tools/cmd/staticcheck"
uv "claude-monitor"
uv "mcp-atlassian"
uv "nano-pdf"
uv "trafilatura"
krew "cnpg"
krew "cond"
krew "df-pv"
krew "kc"
krew "krew"
krew "neat"
krew "nodepools"
krew "view-allocations"
krew "view-utilization"
npm "@anthropic-ai/claude-code"
npm "@playwright/cli"
npm "@playwright/mcp"
